<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Identifier</key>
    <string>com.github.sryley.jamf.AdobeAcrobatReaderDC</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Adobe Acrobat Reader DC</string>
        <key>CATEGORY</key>
        <string>Adobe</string>
        <key>POLICY_CATEGORY</key>
        <string>Monthly Patching</string>
        <key>POLICY_NAME</key>
        <string>Install - %NAME%</string>
        <key>POLICY_TEMPLATE</key>
        <string>JamfPolicyTemplateAllUsers.xml</string>
        <key>SELF_SERVICE_ICON</key>
        <string>AdobeAcrobatReaderDC.png</string>
        <key>POLICY_TRIGGER</key>
        <string>acrobat</string>
        <key>UPDATE_PREDICATE</key>
        <string>(pkg_uploaded == False) OR (override == True)</string>
    </dict>
    <key>MinimumVersion</key>
    <string>2.3</string>
    <key>ParentRecipe</key>
    <string>com.github.autopkg.pkg.AdobeReader</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_category</key>
                <string>%CATEGORY%</string>
            </dict>
            <key>Processor</key>
            <string>com.github.autopkg.jss.AddCategoryIfNotExists</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>icon</key>
                <string>%SELF_SERVICE_ICON%</string>
                <key>policy_name</key>
                <string>%POLICY_NAME%</string>
                <key>policy_template</key>
                <string>%POLICY_TEMPLATE%</string>
                <key>replace_policy</key>
                <string>True</string>
            </dict>
            <key>Processor</key>
            <string>com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader</string>
        </dict>
    </array>
</dict>
</plist>
