<dict>
    <key>Identifier</key>
    <string>com.github.sryley.recipes.jamf.MicrosoftEdge</string>
    <key>Description</key>
    <string>Downloads and packages the latest version of Microsoft Edge for use with Jamf Pro.</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Microsoft Edge</string>
        <key>VERSION</key>
        <string>latest</string>
    </dict>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>com.github.autopkg.download</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://go.microsoft.com/fwlink/?linkid=2069324</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>com.github.autopkg.pkg</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_identifier</key>
                <string>com.microsoft.edge</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>com.github.jamf.jamfuploader.Upload</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>com.github.autopkg.jss.AddCategoryIfNotExists</string>
            <key>Arguments</key>
            <dict>
                <key>category</key>
                <string>1-Monthly Patching</string>
            </dict>
        </dict>
    </array>
</dict>
