<?xml version="1.0" encoding="utf-8"?>
<policy>
    <general>
        <name>%POLICY_NAME%</name>
        <enabled>true</enabled>
        <trigger_checkin>true</trigger_checkin>
        <trigger_enrollment_complete>false</trigger_enrollment_complete>
        <frequency>Ongoing</frequency>
        <retry_event>check-in</retry_event>
        <retry_attempts>2</retry_attempts>
        <notify_on_each_failed_retry>false</notify_on_each_failed_retry>
        <category>
            <name>%POLICY_CATEGORY%</name>
        </category>
    </general>
    <scope>
        <all_computers>false</all_computers>
    </scope>
    <package_configuration>
        <packages>
            <size>1</size>
            <package>
                <name>%pkg_name%</name>
                <action>Install</action>
            </package>
        </packages>
    </package_configuration>
    <self_service>
        <use_for_self_service>false</use_for_self_service>
    </self_service>
</policy>
