<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Comment</key>
		<string>Recipe automatically generated from com.github.rtrouton.jss.Firefox by JamfRecipeMaker</string>
		<key>Identifier</key>
		<string>com.github.smr1619.zoom.sr.jamf.policy.recipe</string>
		<key>Input</key>
		<dict>
			<key>CATEGORY</key>
			<string>Autopkgr_Uploads</string>
			<key>NAME</key>
			<string>Zoom</string>
			<key>POLICY_CATEGORY</key>
			<string>Testing</string>
			<key>POLICY_NAME</key>
			<string>Update Zoom %NAME%</string>
			<key>POLICY_TEMPLATE</key>
			<string>/Users/Shane.Ryley/Library/AutoPkg/RecipeRepos/policy_template.xml</string>
		</dict>
		<key>MinimumVersion</key>
		<string>2.3</string>
		<key>ParentRecipe</key>
		<string>com.github.homebysix.pkg.Zoom</string>
		<key>Process</key>
		<array>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>pkg_category</key>
					<string>%CATEGORY%</string>
				</dict>
				<key>Processor</key>
				<string>com.github.grahampugh.jamf-upload.processors/JamfPackageUploader</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>icon</key>
					<string>%NAME%.png</string>
					<key>policy_name</key>
					<string>%POLICY_NAME%</string>
					<key>policy_template</key>
					<string>%POLICY_TEMPLATE%</string>
					<key>replace_policy</key>
					<string>True</string>
				</dict>
				<key>Processor</key>
				<string>com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader</string>
			</dict>
		</array>
	</dict>
</plist>
