<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Recipe to update Zoom policy in Jamf Pro</string>
	<key>Identifier</key>
	<string>com.github.smr1619.zoom.sr.jamf.policy.recipe</string>
	<key>Input</key>
	<dict>
		<key>CATEGORY</key>
		<string>Autopkgr_Uploads</string>
		<key>NAME</key>
		<string>zoom.us</string>
	</dict>
	<key>MinimumVersion</key>
	<string>2.3</string>
	<key>ParentRecipe</key>
	<string>com.github.homebysix.pkg.Zoom</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>com.github.grahampugh.jamf-upload.processors/JamfPackageUploader</string>
			<key>Arguments</key>
			<dict>
				<key>pkg_category</key>
				<string>%CATEGORY%</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>/Library/AutoPkg/RecipeRepos/com.github.autopkg.grahampugh-recipes/JamfUploaderProcessors/JamfPackageUploader.py</string>
			<key>Arguments</key>
			<dict>
				<key>policy_id</key>
				<string>%jamf_policy_id%</string>
				<key>pkg_category</key>
				<string>%CATEGORY%</string>
				<key>pkg_name</key>
				<string>Zoom.pkg</string>
				<key>pkg_version_comparison_key</key>
				<string>version</string>
				<key>pkg_version_comparison</key>
				<string>greater_than</string>
			</dict>
			<key>Input</key>
			<dict>
				<key>CATEGORY</key>
				<string>%pkg_category%</string>
			</dict>
		</dict>
	</array>
</dict>
</plist>
