<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Recipe automatically generated from com.github.jss-recipes.jss.Zoom by JamfRecipeMaker</string>
	<key>Identifier</key>
	<string>com.github.smr1619.zoom.sr.jamf.policy.recipe</string>
	<key>Input</key>
	<dict>
		<key>CATEGORY</key>
		<string>Autopkgr_Uploads</string>
		<key>NAME</key>
		<string>zoom</string>
	</dict>
	<key>MinimumVersion</key>
	<string>2.3</string>
	<key>ParentRecipe</key>
	<string>com.github.homebysix.pkg.Zoom</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>category_name</key>
				<string>Autopkgr_Uploads</string>
			</dict>
			<key>Processor</key>
			<string>com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_category</key>
				<string>Autopkgr_Uploads</string>
				<key>category_name</key>
				<string>Autopkgr_Uploads</string>
			</dict>
			<key>Processor</key>
			<string>com.github.grahampugh.jamf-upload.processors/JamfPackageUploader</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>policy_name</key>
				<string>ZoomTest</string>
				<key>package_name</key>
				<string>zoom</string>
			</dict>
			<key>Processor</key>
			<string>com.github.jamf.jamfpolicyuploader</string>
		</dict>
	</array>
</dict>
</plist>
